v2206/Projects/solverTests/ADTank_lam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    GeoTank
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32056;
        startFace       1366274;
    }
    GeoShaft
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21432;
        startFace       1398330;
    }
)

// ************************************************************************* //
