v2206/Projects/solverTests/ADTank_lam/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 2 -2 0 0 0 0];

internalField       uniform 1.013e5;

boundaryField
{
    allBoundary
    {
        type            calculated;
        value           $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }

    GeoTank
    {
        type            calculated;
        value           $internalField;
    }

    GeoShaft
    {
        type            calculated;
        value           $internalField;
    }

        
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
