v2206/Projects/solverTests/ADTank_lam/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{
    allBoundary
    {
                type            calculated;
    }

    top
    {
                value           $internalField;
    }
    
    GeoTank
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    GeoShaft
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
